Autodesk.Revit.DB.Electrical.ElectricalDemandFactorRule
This enum describes the different demand factor rule types available to the application.
Within a demand factor a rule will be referenced and the user will have to enter values
corresponding to that rule.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorRule.LoadTablePerPortion
This rule will apply the demand factor differently for each row in the table.
For example, the 3000kVA will have a 100% demand factor applied, the next 9000 will have a 35% factor applied,
and the remaining items will have a 25% factor applied.

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorRule.QuantityTablePerPortion
This rule will apply the demand factor differently for each row in the table.
For example, the first two (largest) items will have a 125% demand factor applied and the
remaining items will have a 75% factor applied.

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorRule.LoadTable
This rule will apply the demand factor for the total load of attached objects to a panel.
It is purely a look-up table. For example, if there are 5000 kVA, the user can specify 125% value is applied.
If there are 20,000 kVA, the user can specify 100% value is applied.

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorRule.QuantityTable
This rule will apply the demand factor for the total quantity of attached objects to a panel.
It is purely a look-up table. For example, the user can specify that 0 to 2 objects get 100% and
2 to 4 objects get 85% and so on.

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorRule.Constant
This rule will apply a constant demand factor to the loads, regardless of values.
It will also be the default for any newly created demand factor, and the default used if a
demand factor cannot be found for a load classification.